namespace consoleProject
{
    /*
     * ФИО студента: Суюндукова София 
     * номер варианта: 3
     * условие задачи (скопировать из листа задания): 
     * 1)Создайте генератор отчетов о продажах, где основные шаги (проверка данных, форматирование, сохранение) будут реализованы с использованием шаблонного метода.	
     * 2)Разработайте календарь с состояниями (добавление события, редактирование, просмотр). Каждое состояние должно определять доступные действия пользователя.
     * 3)Разработайте консольную игру, где игрок может управлять персонажем с помощью команд. Реализуйте команды для движения, атаки и использования предметов.
     */
    internal class Program
    {
        static void Main(string[] args)
        {
            
        }
    }
}